[
  {
  "id": 1,
  "title": "What is an API?",
  "path": "articles/1.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "An API is like a request-and-response system for software. You send it specific instructions (input), and it gives you back the information or result you asked for (output), just like placing an order and getting exactly what you requested."
},
  {
  "id": 2,
  "title": "What is Redis Cache and Database?",
  "path": "articles/2.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "Redis (Remote Dictionary Server) is an open-source, in-memory, multi-model database known for its sub-millisecond latency. Imagine Redis like a super-fast notebook for your applications — one that lives entirely in memory (RAM), not on a slow disk."
},
  {
  "id": 3,
  "title": "What is Hash Table and Hashing?",
  "path": "articles/3.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "A hash table is like a smart locker system where each item is stored in a locker using a unique code, called a 'key'. Instead of searching one-by-one, the locker number is calculated using a special function known as a 'hash function'."
},
  {
  "id": 4,
  "title": "What is a CDN and How Does It Work?",
  "path": "articles/4.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "A Content Delivery Network (CDN) is a globally distributed network of servers that delivers web content to users from the server closest to them. It speeds up websites, reduce loading times, and improve the user experience."
},
  {
  "id": 5,
  "title": "What is DNS and How Does It Work?",
  "path": "articles/5.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "DNS stands for Domain Name System. It’s like the phonebook of the internet, translating human-friendly domain names (like hello.com) into computer-friendly IP addresses."
},
  {
  "id": 6,
  "title": "What is CI/CD and What Is It Used For?",
  "path": "articles/6.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "CI/CD stands for Continuous Integration and Continuous Delivery (or Deployment). It is a development practice and automation pipeline that enables teams to deliver code changes more frequently, reliably, and efficiently."
},
  {
  "id": 7,
  "title": "What Are JWT Tokens and How Do They Work?",
  "path": "articles/7.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "JWT stands for JSON Web Token, a compact and self-contained way to transmit information securely between parties as a JSON object."
},
  {
  "id": 8,
  "title": "What is HTTP and How Does it Work?",
  "path": "articles/8.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "HTTP stands for HyperText Transfer Protocol. It's a set of rules that defines how messages are formatted and transmitted across the internet. You can think of HTTP as the language your browser uses to speak to a server."
},
  {
  "id": 9,
  "title": "What is OAuth?",
  "path": "articles/9.json",
  "image": "https://raw.githubusercontent.com/mesons-web/lca-sd/refs/heads/main/Images/img1.png",
  "summary": "OAuth (Open Authorization) is a secure way to authorize third-party applications to access your resources, like profile information, photos, or emails, without compromising your credentials."
}
]
